trunk/app/controllers/users_controller.rb

INSERT INTO "users" ("loginName", "salt", "userName", "address", "created_at", "registered", "updated_at", "hashed_password", "emailId", "contactNumber") VALUES('sonia', 'dsndnsnk', 'sonia', 'dsdsdsds', '2009-11-06 05:05:48', 'f', '2009-11-06 05:05:48', 'dsds', 'dsidsih@fnsd.com', 42372997239)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 2)
UPDATE "users" SET "updated_at" = '2009-11-06 05:06:48', "hashed_password" = '' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 4)
DELETE FROM "users" WHERE "id" = 4
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy