trunk/rails/location/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])


      if @user.save
---
INSERT INTO "users" ("salt", "userName", "Name", "updated_at", "hashed_password", "registered", "emailId", "contactNumber", "address", "created_at", "imeiNumber") VALUES('491618800.822969080947442', 'ashwini1', 'ashwini', '2009-12-11 15:27:26', '02ac623772fe6b74596a3ffb2f13868ac871f92c', NULL, 'ashwinigadling@gmail.com', 83752357092375, 'jwkbouwb', '2009-12-11 15:27:26', NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 7)
UPDATE "users" SET "name" = 'kjfngon', "hashed_password" = '9122348f1014dbea26ee9b1b8d19a01ffcb73ee9', "emailId" = 'wjbwoidio@gmail.com', "updated_at" = '2009-12-11 17:38:18', "salt" = '442658900.969435203745731' WHERE "id" = 17

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1