rails/location/app/controllers/locations_controller.rb

SELECT * FROM "locations"
---
  def index
    @locations = Location.all

SELECT * FROM "locations" WHERE ("locations"."id" = 4)
---
  def show
    @location = Location.find(params[:id])

SELECT * FROM "locations" WHERE ("locations"."id" = 4)
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO "locations" ("latitude", "updated_at", "time", "username", "phonenumber", "longitude", "created_at", "commType") VALUES(NULL, '2009-12-11 17:58:13', NULL, NULL, NULL, NULL, '2009-12-11 17:58:13', 'Call')
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

INSERT INTO "locations" ("latitude", "created_at", "phonenumber", "updated_at", "username", "time", "longitude", "commType") VALUES(-42.42, '2009-12-11 07:43:26', 987654321, '2009-12-11 07:43:26', 'cibin', '2005-08-12 12:12:00', -42.42, 1)
---
  def mobileUpdate

    location = {"latitude"=>params[:latitude_integer]+"."+params[:latitude_float],
     "time(1i)"=>params[:yyyy],
     "phonenumber"=>params[:phonenumber],
     "time(2i)"=>params[:mm],
     "username"=>params[:username],
     "time(3i)"=>params[:dd],
     "time(4i)"=>params[:hh],
     "time(5i)"=>params[:min],
     "longitude"=>params[:longitude_integer]+"."+params[:longitude_float],
     "commType"=>params[:commType]}

    @location = Location.new(location)

    respond_to do |format|
      if @location.save

SELECT * FROM "locations" WHERE ("locations"."id" = 4)
UPDATE "locations" SET "updated_at" = '2009-12-11 07:15:11', "time" = '2002-01-01 22:04:00' WHERE "id" = 3
---
  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])

SELECT * FROM "locations" WHERE ("locations"."id" = 3)
DELETE FROM "locations" WHERE "id" = 3
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy