rails/location/app/controllers/map_controller.rb

SELECT * FROM "locations" WHERE (username='cibin') LIMIT 1
---
  def index
    # Create a new map object, also defining the div ("map")
    # where the map will be rendered in the view
    @map = GMap.new("map")
    # Use the larger pan/zoom control but disable the map type
    # selector
    @map.control_init(:large_map => true,:map_type => true)
    # Center the map on specific coordinates and focus in fairly
    # closely
    #@map.center_zoom_init([41.023849,-80.682053], 10)

      print session[:user_id]
      print session[:id]
      print session[:user_session]

    @locations = Location.find(:all, :conditions => [ "username=?",session[:user_id]])