rails/location/app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "userName", "Name", "updated_at", "hashed_password", "registered", "emailId", "contactNumber", "address", "created_at", "imeiNumber") VALUES('491618800.822969080947442', 'ashwini1', 'ashwini', '2009-12-11 15:27:26', '02ac623772fe6b74596a3ffb2f13868ac871f92c', NULL, 'ashwinigadling@gmail.com', 83752357092375, 'jwkbouwb', '2009-12-11 15:27:26', NULL)
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 7)
UPDATE "users" SET "hashed_password" = '14051e10218d651d0a61d82b92ca591f478b26bc', "updated_at" = '2009-12-08 07:27:42', "salt" = '493751400.337370189951485', "userName" = 'vyvu' WHERE "id" = 7
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy