app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT * FROM "locations"

  def show
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def edit
    @location = Location.find(params[:id])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)

  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("latitude", "created_at", "phonenumber", "updated_at", "username", "time", "longitude", "commType") VALUES(2388923789.0, '2009-11-06 05:01:01', 24369868926, '2009-11-06 05:01:01', 'sonia', '2009-11-06 05:00:00', 23328779237.0, 1)

  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])
---
SELECT * FROM "locations" WHERE ("locations"."id" = 1)
UPDATE "locations" SET "updated_at" = '2009-11-07 02:13:15', "longitude" = -80.682053, "latitude" = 41.023849 WHERE "id" = 1