app/controllers/map_controller.rb

  def index
    @map = GMap.new("map")
    # Use the larger pan/zoom control but disable the map type
    # selector
    @map.control_init(:large_map => true,:map_type => false)
    # Center the map on specific coordinates and focus in fairly
    # closely

    @locations = Location.find(:all, :conditions => [ "username=?",session[:user_session]])
---
SELECT * FROM "locations" WHERE (username='#session[:user_session]')